Revit 2027 API
CurveLoop.IsRectangular Method
 Identifies if the curve loop is rectangular with respect to a given projection plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRectangular(
	Plane plane
)
Public Function IsRectangular (
	plane As Plane
) As Boolean
public:
bool IsRectangular(
	Plane^ plane
)
member IsRectangular :
        plane : Plane -> bool
Parameters
plane Plane
 The plane to which the curves will be projected to determine if they represent a rectangle.
Return Value
Boolean
 True if the curve loop is rectangular, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace